[
  {
    "year": 1,
    "semester": 1,
    "major": "Information Systems",
    "code": "IS001",
    "modules": [
      {
        "code": "MATH101",
        "name": "Analysis 1",
        "description": "Covers fundamental concepts of mathematical analysis, including limits, continuity, differentiation, and integration."
      },
      {
        "code": "MATH102",
        "name": "Algebra 1",
        "description": "Focuses on linear algebra and fundamental algebraic structures, including matrices, determinants, and vector spaces."
      },
      {
        "code": "CS101",
        "name": "Data Structures and Algorithms 1",
        "description": "Introduces fundamental data structures like arrays, linked lists, stacks, and queues, along with basic algorithmic techniques."
      },
      {
        "code": "CS102",
        "name": "Machine Structure 1",
        "description": "Covers the basics of computer architecture, including binary representation, logic gates, and assembly language concepts."
      },
      {
        "code": "EE101",
        "name": "Electronics and System Components",
        "description": "Explores fundamental electronic components and circuits, including resistors, capacitors, transistors, and their applications."
      },
      {
        "code": "ENG101",
        "name": "English",
        "description": "Enhances English language skills, focusing on academic writing, reading comprehension, and oral communication."
      },
      {
        "code": "SCI101",
        "name": "Scientific Terminology",
        "description": "Introduces essential scientific and technical terms used across various engineering and computer science disciplines."
      }
    ]
  },
  {
    "year": 1,
    "semester": 2,
    "major": "Information Systems",
    "code": "IS001",
    "modules": [
      {
        "code": "MATH103",
        "name": "Analysis 2",
        "description": "Continuation of Analysis 1, covering sequences, series, and multivariable calculus concepts."
      },
      {
        "code": "MATH104",
        "name": "Algebra 2",
        "description": "Expands on Algebra 1 topics, introducing abstract algebra, linear transformations, and eigenvalues."
      },
      {
        "code": "CS103",
        "name": "Data Structures and Algorithms 2",
        "description": "Explores advanced data structures like trees, graphs, and hashing, along with more complex algorithmic techniques."
      },
      {
        "code": "CS104",
        "name": "Machine Structure 2",
        "description": "Continues Machine Structure 1, focusing on microprocessors, memory management, and system performance."
      },
      {
        "code": "STAT101",
        "name": "Probability and Statistics 1",
        "description": "Introduces fundamental probability theory, statistical methods, and data analysis techniques."
      },
      {
        "code": "MATH105",
        "name": "Mathematical Tools for Programming",
        "description": "Covers essential mathematical techniques for computer science, including discrete mathematics and logic."
      },
      {
        "code": "ICT101",
        "name": "Information and Communication Technology",
        "description": "Explores modern ICT concepts, including networking, cloud computing, and digital communication technologies."
      }
    ]
  }
]
